{"http://pitchfork.com/rss/news/": "About Site - Pitchfork is the web's most popular music resource, with expansive daily coverage of indie rock, hip-hop, electronic, pop, metal, and experimental music. Publishing daily reviews, features, and interviews, as well as real-time music news coverage. Frequency - about 84 posts per week ", "http://www.youredm.com/feed": "About Site - Sharing the latest and greatest in the Electronic Dance Music (#EDM) scene. Frequency - about 84 posts per week ", "http://consequenceofsound.net/feed/": "About Site - Consequence of Sound is an online music publication updated daily with music news, MP3s, tour dates, album reviews, festival lineups, and more. Frequency - about 84 posts per week ", "http://feeds.feedburner.com/metalinjection": "About Site - The leading metal news, metal music video and metal tour date source on the internet. Get your fix of Metal Injection! Frequency - about 56 posts per week ", "http://pigeonsandplanes.com/feeds/generator/e/n/3.rss": "About Site - New music and music news delivered daily, ranging from hip-hop and pop to indie rock and electronic. We're always listening. Frequency - about 15 posts per week ", "http://edm.com/feeds/articles": "About Site - The world's foremost authority on EDM : free music downloads, artist interviews, industry news, curated playlists, trending charts, and more. Frequency - about 24 posts per week ", "https://www.reddit.com/r/Music/.rss": "About Site - The musical community of reddit. Frequency - about 168 posts per week ", "http://runthetrap.com/feed/": "About Site - Your source for all things trap music, hip hop, 808 bass music & everything in between. A new order for underground music and culture. Frequency - about 34 posts per week ", "http://www.rap-up.com/feed/rss": "About Site - Rap-Up is a national hip-hop and R&B magazine. Founded in 2001, the full-color, glossy publication has featured music's biggest stars including 50 Cent, Beyoncé, T.I., Ciara, Rihanna, Eve, Nelly, Pharrell, Mary J. Blige, The Game, and Nicole Scherzinger.  Frequency - about 42 posts per week ", "http://feeds.feedburner.com/metalunderground": "About Site - MetalUnderground.com has been faithfully serving mainstream and underground metal news for almost ten years. In addition to comprehensive news coverage, Metalunderground.com also features reviews, interviews, band info, live concert reports, photos, and more, updated daily by a dedicated staff of die-hard metalheads. Frequency - about 84 posts per week ", "http://www.allmusic.com/rss": "About Site - AllMusic is a comprehensive and in-depth resource for finding out more about the albums, bands, musicians and songs you love. Frequency - about 2 posts per week ", "http://dancingastronaut.com/feed": "About Site - Dancing Astronaut is the leading dance music media site in the US. Dancing Astronaut's mission is to expose and promote electronic dance music in the digital media space in order to grow the industry's reach and support talented artists. Frequency - about 84 posts per week ", "http://feeds.feedburner.com/Metalsucks": "About Site - MetalSucks is a Heavy Metal News, Gossip, Videos and Track Streams. They blog about Metal.  Frequency - about 56 posts per week ", "http://www.npr.org/rss/rss.php?id=1039": "About Site - All Songs Considered is the place to discover music. The acclaimed weekly program – available as streaming audio, a podcast and a broadcast – melds contemporary music, live concerts, videos and artist interviews to offer a truly eclectic mix. Frequency - about 56 posts per week ", "http://www.stereogum.com/feed": "About Site - The original new music blog. MP3s, videos, news, reviews, and indie rock gossip. Frequency - about 84 posts per week ", "https://www.theguardian.com/music/musicblog/rss": "About Site - Latest news and features related to music from theguardian.com, the world's leading liberal voice. Frequency - about 1 post per week ", "http://www.nme.com/feed": "About Site - NME.COM brings you the latest music news and reviews, along with music videos and galleries, plus band features, blogs on your favourite artists, concert tickets, competitions and more. Frequency - about 84 posts per week ", "http://feeds.feedburner.com/TheFaderMagazine": "About Site - The FADER is the definitive voice of music and the lifestyle that surrounds it. Frequency - about 84 posts per week ", "http://www.factmag.com/feed/": "About Site - The world's most on-it music blog and magazine, home of the weekly FACT mix series and FACT TV. Frequency - about 28 posts per week Since - Sep 2016 ", "http://mixmag.net/rss-category/blog": "About Site - Get the latest dance news and videos from Mixmag. Frequency - about 2 posts per week ", "http://www.brooklynvegan.com/feed": "About Site - BrooklynVegan is an independent, NYC-centric, mostly-music blog that focuses on international music news, live show reviews, pictures, tour dates, gossip, tips, MP3’s, streams, videos, and much more.  Frequency - about 56 posts per week Since - Jan 2001 ", "http://2dopeboyz.com/feed/": "About Site - 2DOPEBOYZ is the latest in Hip-Hop and rap music—from mixtapes to insightful editorials. Frequency - about 56 posts per week ", "http://www.tinymixtapes.com/feed.xml": "About Site - At Tiny Mix Tapes, we provide both up-to-date and dated news, reviews, interviews, and articles on different genres in the vast music world, including independent releases, major label releases, and even self-releases.  Frequency - about 56 posts per week ", "http://www.edmsauce.com/feed": "About Site - EDM Sauce is one of the largest independent websites dedicated to new Electronic Dance Music, News, Technology and Humor. Frequency - about 56 posts per week ", "http://www.okayplayer.com/feed/rss": "About Site - Okayplayer is the original progressive urban music site and maintains its position as the premier digital destination for music connoisseurs worldwide. Okayplayer delivers the full spectrum of groundbreaking music to your fingertips (and earphones) everyday. Well-established as the gold standard in online hip-hop and many more. Frequency - about 56 posts per week ", "http://www.popjustice.com/feed/": "About Site - Popjustice is a website which bangs on about pop music at considerable length. We have been giving pop the respect it deserves and the disrespect it deserves since the turn of the century. Frequency - about 2 posts per week ", "http://hiphopwired.com/feed/": "About Site - Keeping You Informed With The Latest on Hip-Hop Culture, Rappers, Hip Hop News, Rap and Entertainment News, Black Politics, Video Vixens, Music Reviews and Urban Lifestyle... Frequency - about 56 posts per week ", "http://slippedisc.com/feed": "About Site - Slipped Disc is an interactive site that receives a constant flow of information from its readers around the world. If something happens in music, you are likely to read it here first. A classical music blog by Norman Lebrecht. Frequency - about 56 posts per week Since - Feb 2007 ", "http://drownedinsound.com/feed": "About Site - DrownedinSound.com, or DiS, is a UK-based music webzine dedicated to new, independent, innovative and groundbreaking music, as well as the best from established artists and international talents.  Frequency - about 15 posts per week ", "http://feeds.feedburner.com/indieshuffle": "About Site - Indie Shuffle is a global music blog that covers indie rock, electronic, hip hop, folk and more. We shuffle through piles of independent music — old and new — so you don’t have to.  Frequency - about 24 posts per week ", "http://thissongissick.com/feeds/feed": "About Site - ThisSongIsSick.com is all about making it easier for you to discover sick new music that you've never heard before. We work with musicians and record labels from all over the world to showcase a variety of the freshest electronic, hip-hop, indie, and alternative music to a global following that is comprised of millions of music lovers in over 110 countries.  Frequency - about 28 posts per week ", "http://feeds.feedburner.com/TheLineOfBestFit": "About Site - New Music Discovery: the best tracks by the hottest emerging bands from the UK, US and beyond. Frequency - about 84 posts per week ", "http://www.gorillavsbear.net/feed/": "About Site - Gorilla vs. Bear is a Texas-based music blog. Once called the New Yorker of hipster blogs, we blog about relevant artists of the day, with no particular genre-specific focus. Frequency - about 12 posts per week ", "http://rapradar.com/feed/": "About Site - Rap Radar is the Premiere Rap Blog for the latest news, music and video in Hip Hop Culture. Frequency - about 56 posts per week Since - Mar 2009 ", "https://www.thefourohfive.com/feed": "About Site - The 405 is an online music and culture magazine packed with the latest music and film news, reviews, and interviews, plus mixtapes, features & much more. Frequency - about 17 posts per week ", "http://www.heavyblogisheavy.com/feed/": "About Site - Heavy Blog (Is Heavy) is a blog dedicated to heavy music and all its friends, featuring metal news, reviews, interviews, and other nincompoopery. Frequency - about 15 posts per week ", "http://earmilk.com/feed": "About Site - Dedicated to music discovery. EARMILK serves the latest music news, streams, downloads and more. We cover everything we love, these include dance, hiphop, and electronic, indie rock, trap, witch-house, edm, post-dubstep, dreamwave, alternative and probably about 500 others - at EARMILK you get the gambit. Frequency - about 34 posts per week ", "http://www.zambianmusicblog.co/feed": "About Site - ZMB Is Zambia’s Number One Local And International Entertainment News/Media Publishing Website That Helps Talented Artists In The Zambian Music Circles Showcase Their Art To The Rest Of The Africans Across The World. Frequency - about 42 posts per week ", "http://theboombox.com/feed": "About Site - Top R&B and hip hop news, music videos, newest songs and exclusive interviews with the hottest rappers and R&B artists. Frequency - about 42 posts per week ", "http://www.elevatormag.com/feed": "About Site - The dopest new hip hop, upcoming artists, music news, culture, and style. Frequency - about 34 posts per week ", "http://www.aquariumdrunkard.com/feed/": "About Site - Aquarium Drunkard is an eclectic audio blog featuring daily music reviews, interviews, features, mp3 samples and sessions. Originating in 2005, digging globally, the Drunkard bridges contemporary sounds with vintage garage, psych, folk, country, soul, funk, r&b and beyond. Frequency - about 8 posts per week ", "http://www.edmidentity.com/feed": "About Site - Join the EDM Identity Team as they explore the electronic dance music genre and culture.EDM Identity strives to provide quality content about electronic dance music and the culture that surrounds it in the US and abroad. Frequency - about 28 posts per week ", "http://www.classical-music.com/rss.xml": "About Site - Classical Music news, listen to classical music online with music reviews and new releases, and the great composers from the world of music with BBC Music Magazine. Online and off, we give you the latest classical music news, guides to the great composers, artist interviews and much more. Frequency - about 6 posts per week ", "http://louderthanwar.com/music/feed": "About Site - Louder Than War is the UK's fastest growing and award-winning music and culture website. We bring you the latest music news and reviews, interviews and features as well as discussion on international punk rock and pop culture. The latest rock, punk, metal and alternative music news, album and gig reviews. Frequency - about 34 posts per week ", "http://www.undertheradarmag.com/site/rss": "About Site - The solution to music pollution. Official website for the indie music magazine with web-exclusive interviews, photos, reviews, mp3s, videos, music news and more. Frequency - about 56 posts per week ", "http://www.thisisrnb.com/feed/": "About Site - ThisisRnB.com is the premiere online destination for mainstream R&B music fans. The website is updated daily, with the latest news, music, videos, performances, interviews, gossip & more. Frequency - about 34 posts per week ", "http://livemusicblog.com/feed": "About Site - We dig concerts, festivals, and bands that know how to play live. A music blog about concerts, festivals, music news, photos, videos, Bonnaroo, Phish, Coachella, Austin City Limits, Lollapalooza and more... Frequency - about 24 posts per week ", "http://blog.songtrust.com/feed": "About Site - Songtrust, a Billboard Magazine Top 10 Music Start-Up, provides a technology platform for royalty collection services to music business professionals. Our industry-leading online solutions help songwriters, artists, managers, labels and publishers simplify music rights management including the administration of music publishing assets, performing rights, and digital licensing. Frequency - about 1 post per month ", "http://music.theaureview.com/feed": "About Site - Discover the best new music on Australia's premiere independent online publication. The AU features exclusive Live Music Reviews and Photo Galleries for Sydney, Melbourne, Brisbane, Perth, Adelaide, Hobart, Wollongong, Darwin and more, plus Singles of the Day, Album Reviews, Interviews and much more. Frequency - about 24 posts per week Since - Jun 2009 ", "https://www.lovablevibes.com/feed": "About Site - Lovablevibes is a Nigeria Music & News Site That Gives Up To Date On The Latest Music, News & Shows,Reviews, Albums, Videos, Entertainment Highlight, Events and more.. Frequency - about 1 post per month ", "https://olagist.co/feed": "About Site - Olagist is a Media based blog that provides all round entertainments such as Latest Songs, Musical Videos, Song Lyrics, Albums, Mixtapes Mp3 Download. Frequency - about 14 posts per week Since - Nov 2015 ", "http://feeds.feedburner.com/nialler9/rss": "About Site - A music site for those interested in the freshest tracks, the best new albums, specially-curated playlists, Irish music news, features, gig guides and much more. Frequency - about 14 posts per week ", "http://www.themusicninja.com/feed/": "About Site - A new music blog about discovering great songs from all genres: trance, experimental, hip/hop, remixes, indie rock, free mp3's, every day reviews. Frequency - about 10 posts per week ", "http://www.noiseprn.com/feed": "About Site - Noiseporn is your ultimate guide to everything dance music, bringing you the latest EDM news, artist interviews, EDM reviews and more. Frequency - about 19 posts per week ", "http://darkport.org/?feed=rss2": "About Site - Metal music blog albums reviews. It is a Large collection of dark, doom, gothic, black, death, power, folk genres. Frequency - about 56 posts per week ", "http://hiphopmusic.ng/feed": "About Site - Hiphopmusic Ng is a Media/Entertainment based blog that provides all round entertainments such as Music, Mp3 Download, Music Videos, Music Lyrics, albums & Media News. Frequency - about 56 posts per week Since - Jul 2015 ", "http://www.fashionably-early.com/feed": "About Site - Fashionably Early provides news and downloads & stream for albums, EPs, mixtapes, songs, videos & much more from the freshest hip-hop, rap, and R&B artists. Frequency - about 56 posts per week ", "http://www.fakeshoredrive.com/feed/": "About Site - Fake Shore Drive is the Midwest's best source for hip-hop. The Chicago-based blog is updated daily with news, music and exclusive content. Frequency - about 15 posts per week ", "http://feeds.feedburner.com/largeheartedboy": "About Site - Largehearted Boy is a literature and music website featuring daily free and legal music downloads as well as news and features from the worlds of music, literature, and pop culture.  Frequency - about 12 posts per week ", "https://www.allthingsgomusic.com/feed": "About Site - Music Discovery I Music Festival Frequency - about 11 posts per week ", "http://awesong.in/feed": "About Site - Awesong.in is the largest unplugged bollywood cover provider which provide mashup, oldies, cover, unplugged, reprise songs. Frequency - about 5 posts per week ", "http://amusicblogyea.com/feed": "About Site - I’m Alicia — creator and owner of A Music Blog, Yea?. I’m 22 and live in Toronto, Ontario. On the music front, I absolutely love going to/photographing concerts and interviewing my favourite people. It’s amazing to have a job that allows me to speak with not only musicians I love, but also wrestlers.  Frequency - about 7 posts per week Since - Jul 2012 ", "http://www.stereofox.com/feed": "About Site - Stereofox is a music blog which helps you discover new indie, alternative and electronic music. Listen, add to favourites and share with friends. Frequency - about 19 posts per week ", "http://greeblehaus.com/category/music/feed": "About Site - Greeblehaus is a Denver lifestyle blog by Aimee Giese covering parenting, music, concert photography, travel and tech. Blog since 2005, Denver since 1994. Frequency - about 2 posts per week Since - Nov 2005 ", "http://emergingindiebands.com/feed": "About Site - For the best emerging bands from around the world. A music blog by Tim Whale. Frequency - about 24 posts per week ", "http://fistintheair.com/feed/": "About Site - Fist In The Air provides fresh new music, daily. Follow this blog to get daily updates on music industry, free music downloads and much more. Frequency - about 1 post per week ", "http://www.thenocturnaltimes.com/feed": "About Site - The Nocturnal Times | Electronic Dance Music (EDM) & Nightlife Culture News For Night Owls Frequency - about 11 posts per week ", "https://ngmp3.com/feed": "About Site - Gistchic is the place for The Latest Nigeria Music , Ghana Music and African Music. Media based Entertainment Blog that provides all around entertainment such as Latest Songs, albums, MP3 and MP4 Download, Music and Videos Frequency - about 19 posts per week Since - Aug 2017 ", "http://www.edmnations.com/feed": "About Site - EDM Nations brings you the best and newest EDM news about your favorite producers/DJ's. From city to city, from country to country, from continent to continent, It brings together all EDM lovers from all nations of this globe. Frequency - about 56 posts per week ", "https://everyrecordtellsastory.com/feed": "About Site - A Blog About Music, Vinyl, More Music and (Sometimes) Music... Frequency - about 1 post per week ", "http://www.anrfactory.com/feed/?format=xml": "About Site - Leading A&R Music Industry Blog - Featuring upcoming unsigned bands and buzz artists from around the world. Frequency - about 42 posts per week ", "http://thegroovecartel.com/feed": "About Site - The Groove Cartel is an electronic dance music network and label company. Founded in 2014 now it's one of the most important community of the genre. Frequency - about 14 posts per week ", "https://fortheloveofbands.com/feed/": "About Site - For The Love Of Bands is your #1 resource to discover awesome new independent & emerging talent. The team consist of highly dedicated music lovers who promote, review and feature any artist for free! As long as they’re awesome of course. Discover your new favourite band today! Frequency - about 2 posts per week ", "https://www.britznbeatz.co.uk/feed.xml": "About Site - Digital music discovery & showcase platform. Breaking music news, new music videos, exclusive interviews, music blogs and​ music events/venue reviews. Frequency - about 11 posts per week ", "http://Next2Shine.com/feed": "About Site - A music community dedicated to discovering & showcasing talents that provide a unique perspective in today's musical landscape. Through revealing interviews with progressive talents, showcasing pieces on emerging trends and cultures, and presentations of products in their raw form, we speak to the influencers in their own language. Frequency - about 4 posts per week Since - Oct 2010 ", "https://aipate.com/feed": "About Site - Kenyan music blog providing access to popular music through reviews, insights, interviews, videos, and albums and news. Frequency - about 21 posts per week Since - Mar 2012 ", "http://www.wherethemusicmeets.com/feed": "About Site - A online music magazine curated by musicholics. Frequency - about 3 posts per week ", "http://www.musicalheartbeat.com/blog/feed.xml": "About Site - Los Angeles-based music blog focused on helping you discover new music & emerging artists. Mission to help share the music that has been overlooked and needs to be heard. Frequency - about 5 posts per week ", "http://depthmag.com/feed": "About Site - Depth Magazine exists because of the love of alternative music; including metal, rock, punk and other related genres such as electronicore. We create music reviews, interviews and other content relevant to the industry, and we do it all with heart. Frequency - about 9 posts per week Since - Jan 2017 ", "http://onestoprecordshop.co.uk/feed": "About Site - The ultimate London-based music and entertainment blog. Discover new music, hot releases, emerging bands and exclusive interviews. We cover pop, rock, indie and more. Frequency - about 5 posts per week ", "http://podcart.co/feed": "About Site - Podcart is a Scottish-based music blog. The team writes about music and things associated with music. They also produce weekly podcasts showcasing the best in grass roots and unsigned artists not only from Scotland, but around the world. Frequency - about 4 posts per week ", "https://surfingsoundwaves.com/feed": "About Site - surfing sound waves is the platform for online music discovery based in Venice, CA. Founded and curated by Irina Liakh @irinaliakh, SSW brings extensive coverage for both indie and pop music, giving voice to the best emerging artists and celebrating established musicians across all genres. Frequency - about 4 posts per month ", "http://www.giveitaspin.gr/feeds/posts/default?alt=rss": "About Site - giveitaspinGR is a website full of humane culture and a bi-weekly show on Paranoise Radio.  Frequency - about 3 posts per week ", "https://www.musictalks.xyz/feed.xml": "About Site - MusicTalks is Where To Find New Music On Our Independent Music Blog. Stories Written By The Artists From Around The World. Frequency - about 9 posts per week ", "https://thisishowyoumusic.wordpress.com/feed": "About Site - The name is Aja and I’m just your everyday awkward avid concert goer who has an extreme love for indie music. If I’m not writing blog posts, I’m probably at a concert or working to get my communications degree from Kennesaw State University. The goal of this blog is to bring attention to what the indie music world has to offer and give helpful concert advice along the way. Frequency - about 1 post per month ", "http://www.kmmreviews.com/feeds/posts/default?alt=rss": "About Site - A music blog about albums, unsigned bands, music reviews, opinions and vinyl Frequency - about 3 posts per week ", "http://www.onthecomeuptv.com/feed": "About Site - On The Come Up TV is a digital multi genre music dojo based in London with a focus on discovering unrivalled talent. Frequency - about 2 posts per month ", "https://macburnersa.blogspot.com/feeds/posts/default?alt=rss": "About Site - A producer, musician, blogger and a young entrepreneur, Hungry for more opportunities and success. Frequency - about 1 post per week ", "https://donald559.wordpress.com/feed": "About Site - Welcome to my blog of Music. Please enjoy and share with others. Run by Donald Miclette. Frequency - about 4 posts per week ", "http://news.shundawallace.com/feed": "About Site - Founder and President Shunda Wallace created a profit gaining Production Company, designed to delve into the world of film (storytelling) from the musician’s perspective. Our education and performance background is in voice, classical-jazz, composition-orchestration, conducting and business.  Frequency - about 2 posts per month Since - Sep 2009 ", "http://www.highclouds.org/feed": "About Site - HighClouds, Music Junkies’ Holy Bible is a project headed by a team of music-addicts. We have varied tastes and we are crazy about emerging talented artists; we run a music blog that has became a real multimedia platform. Our main focus is reviewing materials (album, EP, video, tracks) from new up and coming artists. We also cover the releases of established ones. Frequency - about 21 posts per week ", "http://undergroundhiphopblog.com/feed": "About Site - HIP HOP SITE FOR THE CULTURE. True underground Hip Hop site consisting of independent artists, producers, DJs, and promoters featuring fresh music from around the world.  Frequency - about 34 posts per week ", "http://daily-beat.com/feed": "About Site - The definitive entertainment platform for electronic dance music. Frequency - about 5 posts per week ", "http://iheartmoosiq.tumblr.com/rss": "About Site - An obsession with music, both recorded and live.  Frequency - about 84 posts per week ", "http://feeds.feedburner.com/LaMusicBlog": "About Site - Los Angeles-based music blog featuring album and concert reviews, music news, giveaways, concert dates, musician interviews, and more! Frequency - about 2 posts per week ", "http://www.dansendeberen.be/feed": "About Site - Music site from Belgium with relevance in the entire Dutch language area, and far beyond. We try to post the most important new musical discoveries or just nice songs on Dancing Bears. In addition, we try to offer added value to other music blogs by giving our own opinion, comparing it with well-known groups or simply adding a nice description. Frequency - about 42 posts per week ", "http://www.grimygoods.com/feed": "About Site - Grimy Goods is L.A.'s premier music lifestyle blog. It's a hip site to discover the best new indie music, concerts, fashion and L.A. life. Frequency - about 6 posts per week ", "http://adhoc.fm/feed/": "About Site - AdHoc is an underground music and visual culture publication created for and by a community of music lovers with a shared ethos: that of building the world you want to see using the materials at your disposal. We're a daily destination for MP3s, videos, mixes, interviews, artist's writings, and cultural commentary-- curated for quality. Frequency - about 4 posts per week ", "http://feeds.feedburner.com/ObscureSound": "About Site - Obscure Sound exposes independent musicians through in-depth features and free MP3s. Frequency - about 15 posts per week ", "http://californiarocker.com/feed": "About Site - Award-Winning Online Music Magazine Frequency - about 13 posts per week ", "http://themusicessentials.com/feed": "About Site - Home to the latest news, reviews, previews, interviews and much more from the world of Electronic Dance Music! Frequency - about 56 posts per week ", "https://www.icareifyoulisten.com/feed": "About Site - I CARE IF YOU LISTEN is an award-winning blog about contemporary classical—or new—music. We cover the new music scene and offer a free seasonal mixtape. Frequency - about 5 posts per week ", "http://indietronica.org/feed": "About Site - Indietronica is a new music blog dedicated to providing news and sounds from the music genre indietronica, which combines elements of indie, electro, electronica, rock and pop. Frequency - about 3 posts per week ", "http://metalnexus.net/feed": "About Site - Metal Nexus is your source of daily information about everything related to metal music. Frequency - about 17 posts per week ", "http://www.eartothegroundmusic.co/feed": "About Site - EarToTheGround is a music blog featuring emerging musicians primarily in folk and Indie rock. Proud to be at the forefront of the #DigitalMusicRevolution. Frequency - about 7 posts per week Since - Jan 2012 ", "http://feeds.feedburner.com/Music30": "About Site - Bobby Owsinski's Music 3.0 Blog features the latest music industry news as well as social media tips and tricks. Frequency - about 5 posts per week ", "https://bythewavs.com/feed": "About Site - By The Wavs has everything from house to hardstyle and dubstep. We have it all and will be reporting on everything and anything EDM. We post mixes, live sets, new songs, concerts, festivals, news and albums. Frequency - about 6 posts per week ", "http://danceandrave.com/feed": "About Site - Dance and Rave is on a mission to build a global community with an interest in or passion for electronic dance music and its culture. Whether your taste is in Deep House or Hardstyle or Trap, it wants to unite people from all around the globe in a movement of peace, love, and unity. Frequency - about 7 posts per week ", "http://blurredculture.com/feed": "About Site - Entertainment and news network bringing you the latest in news, music, art & culture. Frequency - about 17 posts per week ", "http://www.weallwantsomeone.org/feed/": "About Site - A Music Blog That Hopes To Enhance Your Life. We All Want Someone To Shout For is a music blog run by Will Oliver. We cover many concerts in NYC, and cover everything else in the music world: New mp3's, news, and album reviews.  Frequency - about 28 posts per week Since - Jul 2008 ", "http://www.hearya.com/feed/": "About Site - A Chicago-based indie music blog featuring exclusive live sessions from our favorite artists. HearYa is an indie music blog that gives indie music enthusiasts a destination to cut through the clutter when discovering new music. Frequency - about 5 posts per week ", "http://www.drunkenwerewolf.com/category/blog/feed": "About Site - DrunkenWerewolf provides daily music reviews, features, interviews and more in a sometimes heated but always passionate manner. With feminism and equal rights at the fore; we aim to give open, honest critique with a twist of Bristolian zest. Frequency - about 2 posts per week ", "http://www.theburningear.com/feed/": "About Site - The Burning Ear is a music blog for people who don’t have time for music blogs. TBE sifts through tons of new music and bring the best of the best right here. TBE focuses on new music but we isn’t about the bleeding edge, the next big thing, or the “new” new. Frequency - about 5 posts per week ", "http://jennthepr.com/feed": "About Site - While growing in the music Industry I went back to school at New York University to pursue my law degree. While working at the club and building up my relationships and connections with many of people in the industry. Frequency - about 56 posts per week ", "https://indiemusicfilter.com/feed": "About Site - Toronto-based music blog finding the best new music in the feeds. To the point track features, videos, quick reviews and streaming playlists. Frequency - about 4 posts per week Since - Jan 2006 ", "http://www.thecomeupshow.com/feed": "About Site - The Come Up Show is a multimedia presentation of Hip Hop culture, dedicated to sharing the latest and greatest in Canadian & International Hip Hop and providing fresh, cutting edge programming. Frequency - about 2 posts per week ", "http://www.theplayground.co.uk/feed": "About Site - UK Music PR, Press & Radio plugging, Music Promotion and Band Promotion, Publicity, Event Promotion, Label, London Music PR. Frequency - about 11 posts per week ", "https://www.wolfinasuit.com/feed": "About Site - Wolf in a Suit is a Music blog but it's turning little by little into a media outlet to showcase new indie music from across the globe and to serve it directly to your ever searching musical palettes. Please enjoy the music, share the passion and simply but surely Howl with the Wolf! Frequency - about 2 posts per week ", "http://poponandon.com/feed": "About Site - POP Music Obsessor/Blogger/Mixer/Masher-Upper/Remix Junkie. Contests, videos, news, exclusives! Be sure to follow for my monthly non-stop mixes of the hottest POP tracks in the POP ON AND ON MEGAMIX series.  Frequency - about 1 post per week ", "http://thebluewalrus.com/feed/atom": "About Site - UK music blog sharing mp3s, streams, and playlists of new bands and artists since 2006 from Walrus Towers in London, UK. Frequency - about 3 posts per month ", "http://www.etmusiquepourtous.com/feed/": "About Site - Et Musique Pour Tous is a boutique music & culture website. EMPT is committed to providing insightful writing, good music and worldwide cultural feed. Our commitment is to quality, not traffic. Frequency - about 3 posts per week ", "http://www.funkish.audio/feed": "About Site - A World Of Funky Music, All In One Place. Click to hear funky music from around the world. Learn about the musicians making amazing Funk music.  Frequency - about 4 posts per month ", "https://concertcrap.com/feed": "About Site - A place to yell or rejoice with concert enthusiasts. Oh and we also have concerts, interviews, photos, giveaways and more. Frequency - about 7 posts per week ", "http://ovrld.com/feed": "About Site - Ovrld has become the leading Austin music site mostly as a result of a bargain with a demonic armadillo named Carl. Ovrld is your guide to the best music from, in, and around the live music capital of the world - Austin, Texas.  Frequency - about 4 posts per week Since - Feb 2011 ", "http://www.myoldkentuckyblog.com/?feed=rss2": "About Site - A music blog that parties with unicorns. #IN & #KY Based Music Blog.  Frequency - about 1 post per week ", "http://feeds.feedburner.com/eqmusicblog/HPsk": "About Site - Promoting and fostering the development of new pop and electronic music through online publishing, live events and social media. Frequency - about 8 posts per week ", "http://coverlaydown.com/feed/": "About Site - Bonus tracks, found coverage, and previews. Because in the folk tradition, music belongs to the community. Cover Lay Down posts new coverfolk features twice weekly, explicitly for the purpose of introducing you to new and previously-unappreciated musicians, that you might follow the threads to those artists’ original works. Frequency - about 2 posts per month ", "http://primalmusicblog.com/feed": "About Site - Irish based music blog focusing on all things reverb, resonance, vibration & echo, shoegaze, ethereal dreampop, post-punk, modern psych rock. Frequency - about 3 posts per week Since - Jan 2015 ", "http://allaroundnewmusic.com/blog/feed": "About Site - All Around New Music the right place for music lovers. The site provides fans with the latest news, music videos. We are also interested in brand new music. Frequency - about 4 posts per week ", "http://kingsofar.com/?feed=rss2": "About Site - Kings of A&R is a well-known for setting tastes in music and discovering unknown talent. A source for tastemakers & Entertainment industry professionals, and a destination where new artists get discovered. Frequency - about 4 posts per week Since - Mar 2005 ", "http://www.thismustbepop.com/feed": "About Site - This Must Be Pop has been online since June 2003, when it was part of the original set of pop music blogs. I focus on showcasing the most promising new pop songs and artists, and discussing the music industry in a way that appeals to those who work within it, as well as those who are just obsessed with it. Frequency - about 3 posts per week ", "http://comeherefloyd.com/category/music/feed": "About Site - A curious curation website featuring awesome indie-music and topical news and information about current events, technology and space. Frequency - about 34 posts per week ", "http://www.nodoughmusic.com/feed": "About Site - We love House and Techno music, no bullshit just pure music. Frequency - about 3 posts per month ", "https://www.kennymp3.com.ng/feeds/posts/default?alt=rss": "About Site - KENNYMP3.COM.NG is now among the most visited website who delivers Hot Fresh Music, Videos, News Content on a daily basis to all Nigerians. Frequency - about 21 posts per week Since - Jul 2016 ", "https://composerstoolbox.com/feed": "About Site - A blog for the composers and audiences of today's music. Frequency - about 2 posts per week Since - Aug 2011 ", "http://www.mzikimzuri.com//feeds/posts/default": "About Site - I am a Radio personality, Blogger, Radio, Web Graphic Design, Mobile App Maker. Frequency - about 28 posts per week ", "http://www.caesarlivenloud.com/feeds/posts/default?alt=rss": "About Site - All the news on your favourite artists and sometimes a little gossip! Video premieres, artworks, Tour info, charts, live performances, free legal music to download, and more! Also a place where young and struggling artists are more than welcome to showcase their work and gain more fans through the blog! The blog is written in portuguese and english and it gives you the information straightforwardly simple!! Frequency - about 56 posts per week ", "https://musyncuk.com/feed": "About Site - Sync. is a regularly updated blog featuring the very best in new music from both established acts as well as newcomers. Sync. is a music blog featuring our pick of the best new music. Content leans towards alternative, indie, and dance  Frequency - about 5 posts per week ", "https://shebops.net/feed": "About Site - SheBOPS is a fresh and vibrant music site, exclusively covering as many of the world’s most brilliant female musicians as humanly possible. It’s the Internet’s premier site for Girl Power in the music industry! Frequency - about 2 posts per week Since - Dec 2015 ", "http://www.spotlightfirst.com/feed": "About Site - SpotlightFirst is a UK based Platform.. We focus on quality music, its impact and the surrounding culture. Generally of (but not limited to) the urban genre (Hip Hop, UK Rap, Grime, R&B etc.) SpotlightFirst prides itself in giving well deserved talent a chance to be heard, seen, and heard again! Delivering exciting and interesting weekly content from new and exclusive music, pictures, videos, articles and one of a kind interviews in a way that’s not seen on any other music sites. Frequency - about 1 post per week ", "http://countryfriedrock.org/feed/podcast": "About Site - Country Fried Rock is for real music lovers who enjoy context and musical connection around their listening.  Frequency - about 1 post per month ", "https://www.themusicmaze.com/feed": "About Site - Helping independent musicians navigate the music business. Frequency - about 1 post per month ", "http://feeds.feedburner.com/co/KTGU": "About Site - Scientists of Sound is a new music blog.Find Daily updates of the Indie, Synth, Pop variety. Frequency - about 6 posts per week ", "http://turtletempo.co.uk/feed": "About Site - A London-based music blog that cares about new music. We are committed to giving talented indie & alternative music artists the recognition they deserve. Frequency - about 2 posts per week ", "http://cruelrhythm.tumblr.com/rss": "About Site - Music music music. new and good. Music is everything. formerly FUCKING DANCE. Frequency - about 6 posts per week ", "http://www.countrymusicnewsblog.com/feed": "About Site - Country Music, Music News, Nashville News, Country Music Artists, Country Music Tour Info, Country Music Tour Dates and more! Frequency - about 8 posts per week ", "http://daftwho.com/?feed=rss2": "About Site - DAFTWHO? is an Australian based electronic music blog that was created and is solely run by Anthony Zayler. Bringing you the best in dubstep, electro, house, drum n bass, trash, techno and everything in between! Frequency - about 1 post per month Since - Oct 2009 ", "http://ninebullets.net/feed": "About Site - 9 Bullets is simply a website about music and the people that make it or support those making it. While there's usually some twang in what we cover that's not a necessity. The only requirement we have in our writing is that we have to be passionate about the music. Frequency - about 3 posts per week ", "http://www.wearesensei.com/music?format=RSS": "About Site - An online community where you can get new songs, artwork, photography or short films from your favorite artists and producers. You can also find new ideas and strategies for personal development and business development right here on WeAreSensei. Frequency - about 19 posts per week ", "https://camphouseconcerts.com/feed/": "About Site - Discover new country songs, country music artists, music festivals and much more. The official blog page of Camp House Concerts. Frequency - about 4 posts per week ", "https://lucymccourt.com/feed": "About Site - My name is Lucy McCourt, I am 16 years old and currently living in West Sussex.I started this blog in late 2015 purely just to have a go at putting my thoughts and opinions on music out into the world. I listen to pop, rock, punk, folk, singer- songwriter, rap and basically any genre you could name. Frequency - about 4 posts per month ", "https://festination.com/magazine/rss/?x=1": "About Site - Festination is your No1. source when it comes to music festivals. Find events all over the world, buy tickets, book accommodation, and have fun! Frequency - about 2 posts per month ", "http://www.thatmusicmag.com/index.php/feed": "About Site - THAT Mag (formerly known as Origivation) is an online magazine dedicated to staying on the cutting edge of music, both locally and nationally. Frequency - about 3 posts per week ", "http://futureclassics.ca/feed": "About Site - Future Classics is a Vancouver based Canadian Electronic music blog with aim to highlight local, Canadian and international artists. Frequency - about 1 post per month ", "https://mrmp3s.co/feed": "About Site - we are small tech company over here in Africa, basically Nigeria, we love music and to share it only when the music is free to listen.  Frequency - about 19 posts per week ", "http://www.indiemusic.life/feed": "About Site - IndieMusic.Life is a free curated online music archive featuring random selections each time you visit the site. Tailor your exploration by following a tag, artist, or genre. Frequency - about 2 posts per month ", "http://www.playbackplayback.com/feed": "About Site - The Playback blog covers everything about music. From latest release to upcoming tracks, news, reviews, it has it all. Frequency - about 8 posts per week ", "http://www.cowgirlzenentertainment.com/feeds/posts/default?alt=rss": "About Site - Music site about Metal, Rock, Punk, Pop, Art, Creatives with interviews, reviews, concert photography. Frequency - about 7 posts per week ", "http://69hub.us/feed": "About Site - 69 Hub “Sixty 9 Hub” is an all round Entertainment Hub, as we are new into the scene, we shall begin firstly with music and grow gradually. In the feature we hope to be your go to guy for all things entertainment, whether music, movies and generally art! Frequency - about 17 posts per week ", "http://www.whitefolksgetcrunk.com/music?format=RSS": "About Site - Free MP3s of Remixes, bootlegs, mashups, and more for DJs, created by DJs. Frequency - about 8 posts per week ", "https://poppedmusic.co.uk/feed": "About Site - PoppedMusic features new music, news, alerts, videos and reviews. Follow this blog to get information on new releases and sometimes the occasional re-release too. Frequency - about 6 posts per week ", "https://top10covers.com/feed": "About Site - the world's best covers, cover performers, and famous cover performers. Frequency - about 3 posts per week ", "http://groovedetector.com/feed": "About Site - Stream albums free at Groove Detector! Enjoy great rap albums and hip hop videos. Find the best unknown rappers and get the best music suggestions now! Frequency - about 3 posts per month Since - Oct 2017 ", "https://musicenthusiast.net/feed": "About Site - At the intersection of rock, blues, R&B, jazz, pop,and soul. For the True Believer. Frequency - about 2 posts per week ", "https://brightonmusicblog.co.uk/feed": "About Site - Brighton Music Blog is the only music blog solely about bands from Brighton.We cover local bands, from newcomers that are just starting out, to more established names who do a great job of representing Brighton in the charts all the way up to international stars. Frequency - about 1 post per week ", "http://xisuma.blogspot.com/feeds/posts/default?alt=rss": "About Site - My music blog describing my thoughts and feelings towards records as I continually seek out new sounds to absorb into my being. Frequency - about 3 posts per week ", "http://www.brunoservina.com/feeds/posts/default?alt=rss": "About Site - Music SUBMIT resources are eager to receive new music from independent & Major artists like you. I'll promote your music across the Internet. You'll get all of these great benefits: -Exposure for your music -Increase In CD Sales* -Radio airplay -Higher ranking in Google -Increased fan base I Promote Island Music & More To Its Fullest Extent To Take Your Music Mainstream. Frequency - about 1 post per month ", "http://dayzofpurpleandorange.blogspot.com/feeds/posts/default?alt=rss": "About Site - A blog about psychedelic music.....it's not all flowers and sugarcubes. Frequency - about 2 posts per week ", "https://thewritereviews.net/feed": "About Site - The Write Reviews is an underground hip hop website dedicated to artists as well as fans. Album reviews, artist interviews, featured emcees, and more! Frequency - about 3 posts per month ", "https://jessicamusic.blogspot.com/feeds/posts/default?alt=rss": "About Site - Classical music blog by journalist and author Jessica Duchen. Topics include classical music, opera, ballet, recordings, books. London, UK. Jessica's work has appeared in The Independent, The JC, The Guardian, The Sunday Times and numerous music magazines. She's the author of five novels, two biographies and a number of stage works combining words and music.  Frequency - about 2 posts per week Since - Mar 2004 ", "https://tracebongo.com/feed": "About Site - Trace Bongo is a Tanzania Website that gives you all trending Entertainment News, New Music and New Videos, New Movies, New Tv series and much more. Frequency - about 34 posts per week ", "http://www.theothersidereviews.com/feed": "About Site - The Other Side Reviews is an online music magazine where writers get together and share their love for music with the world. Our international team review, interview and tell you what’s up in the world of tunage. Frequency - about 2 posts per week ", "https://sluggingavampire.wordpress.com/feed": "About Site - Classical music blogger. Sometimes political on twitter. 'Slugging a Vampire' is the title of a 20-second long Charles Ives song. Frequency - about 1 post per week Since - Apr 2016 ", "http://stabbedpanda.com/wp/category/music/feed": "About Site - The various musical endeavours of Stabbed Panda, including interviews, reviews, tutorials and original music. Frequency - about 2 posts per month ", "https://www.youtube.com/feeds/videos.xml?channel_id=UC5nc_ZtjKW1htCVZVRxlQAQ": "About Site - On this channel you will find a wide variety of different electronic and sometimes non-electronic music. We strive to find the best and most enjoyable music for you guys.  Frequency - about 6 posts per week ", "https://www.youtube.com/feeds/videos.xml?user=Buttonpushaz": "About Site - Chicago based Hip Hop and RnB music videos shot by Passport Trace. He has shot numerous videos for artists such as I.L Will, Lil Chris, Mikey Dollaz, ChellaH, Sasha Go Hard, Lud Foe, D-LOW, Breezy Montana, Bekoe, Stunt Taylor, Bo Deal, Cago Leek, Romiti and others. His work can be seen on numerous blog sites such as Complex, XXL, Vibe, MTV, Fake Shore Drive, THISis50, and ILLANOiZE etc. Frequency - about 4 posts per week ", "http://ilovegreatmusic.net/feed": "About Site - The #1 Source for Music. Updated Daily with the Latest Urban Music, Videos, Albums, Mixtapes & News Articles. Download & Stream Music for Free. Frequency - about 34 posts per week ", "http://www.undergroundinterviews.org/feeds/posts/default?alt=rss": "About Site - Underground Interviews is your one stop shop for underground music. If you want to hear some of the newest and best underground music check us out! Frequency - about 3 posts per month ", "https://indieblogfest.com/feed": "About Site - A music blog focused on promoting up & coming bands, and keeping you up to date with all the latest music news. We are an independent music blog, talking about everything from new music and gig reviews to tour news and festivals. Frequency - about 1 post per week ", "http://www.musicassent.com/feed": "About Site - Music Assent is an Online Media Source, Keeping Follower's Up To Date On Everything Trending In Music Around The World, Memorable Days In Music, Random Music Facts, Album Releases, New Videos, Upcoming Artists, Concert announcements, and Much, Much More! Frequency - about 2 posts per week Since - Jan 2017 ", "https://yackmagazine.com/feed": "About Site - Writing stuff about music, culture and anything else that takes our fancy. Frequency - about 2 posts per month ", "https://mumblingabout.com/feed": "About Site - This blog could now be a testament to procrastination. I mumble, mutter, rant and pontificate too much about music and books so I thought I’d write it down instead and save the ears of my loved ones from having to block out my opinions.  Frequency - about 4 posts per month ", "https://scragglybones.wordpress.com/feed": "About Site - Scraggly Bones is a Music Blog based in Brighton established in 2018. I began recording at an early age on an old tape deck & went on to study music at college. Performing with a variety of musicians at venues including the Concorde 2 & BBC South Live. I started this blog simply because I have always loved seeking out new music. The featured Artists, reviews & live shows are all something I am personally interested in. Frequency - about 5 posts per week ", "https://rockinrollins.wordpress.com/feed": "About Site - Rockin Rollins is music blog based on Indonesia since April 2016 and post about album review, live review, new songs, and new music videos. Because Rockin Rollins from Indonesian, so the language on this blog use Bahasa. But for the music, Rockin Rollins will accept any kind of music from around the world. Frequency - about 2 posts per month ", "http://www.thewildhoneypie.com/feed/": "About Site - We're a collective of filmmakers, producers, writers and designers supporting genuinely great music. Music blog, original videos and events. Frequency - about 2 posts per week ", "https://www.fortheloveofbands.com/4/feed": "About Site - For The Love Of Bands is your number one resource to discover awesome new independent and emerging talent! Frequency - about 2 posts per week ", "https://oiamusic.com/blog/feed": "About Site - Oiamusic.com is your destination of everything related to music and musical instruments. We always try our best to help musicians and anyone who loves music find their best instruments. Frequency - about 1 post per week "}